7767517
8 1
Input_t input_op0 0 1 in 0=1
Embed_t embed_op1 1 1 in 1 0=512 1=32000 2=16384000 3=0
UnaryOp_t rmsnorm_op2 1 1 1 2 0=Square
Reduction_t rmsnorm_op3 1 1 2 3 0=Mean 1=-1
BinaryOp_t rmsnorm_op4 1 1 3 4 0=Add 1=Param 2=0.000010
UnaryOp_t rmsnorm_op5 1 1 4 5 0=Rsq
BinaryOp_t rmsnorm_op6 2 1 1 5 6 0=Mul 1=Tensor
MemoryData_t rmsnorm_op7 0 1 7 0=1 1=512 2=16384000
BinaryOp_t rmsnorm_op7 2 1 6 7 8 0=Mul 1=Tensor