7767517
1024 12 768 12 15 23 44
Input_t input 0 1 in
Input_t freqs_cos 0 1 freqs_cos
Input_t freqs_sin 0 1 freqs_sin
Input_t k_cache_0 0 1 k_cache_0
Input_t v_cache_0 0 1 v_cache_0
Input_t k_cache_1 0 1 k_cache_1
Input_t v_cache_1 0 1 v_cache_1
Input_t k_cache_2 0 1 k_cache_2
Input_t v_cache_2 0 1 v_cache_2
Input_t k_cache_3 0 1 k_cache_3
Input_t v_cache_3 0 1 v_cache_3
Input_t k_cache_4 0 1 k_cache_4
Input_t v_cache_4 0 1 v_cache_4
Input_t k_cache_5 0 1 k_cache_5
Input_t v_cache_5 0 1 v_cache_5
Input_t k_cache_6 0 1 k_cache_6
Input_t v_cache_6 0 1 v_cache_6
Input_t k_cache_7 0 1 k_cache_7
Input_t v_cache_7 0 1 v_cache_7
Input_t k_cache_8 0 1 k_cache_8
Input_t v_cache_8 0 1 v_cache_8
Input_t k_cache_9 0 1 k_cache_9
Input_t v_cache_9 0 1 v_cache_9
Input_t k_cache_10 0 1 k_cache_10
Input_t v_cache_10 0 1 v_cache_10
Input_t k_cache_11 0 1 k_cache_11
Input_t v_cache_11 0 1 v_cache_11
Embed_t input_embed 1 1 in 1 0=768 1=32000 2=0
UnaryOp_t layer0_attnorm_square 1 1 1 2 0=Square
Reduction_t layer0_attnorm_mean 1 1 2 3 0=Mean 1=1
BinaryOp_t layer0_attnorm_add 1 1 3 4 0=Add 1=Param 2=1e-06
UnaryOp_t layer0_attnorm_rsq 1 1 4 5 0=Rsq
BinaryOp_t layer0_attnorm_mul1 2 1 1 5 6 0=Mul 1=Tensor
MemoryData_t layer0_attnorm_weight 0 1 7 0=1 1=768 2=24576000
BinaryOp_t layer0_attnorm_mul2 2 1 6 7 8 0=Mul 1=Tensor
MemoryData_t layer0_att_wq_weight 0 1 9 0=2 1=768 2=768 3=24576768
Matmul_t layer0_att_q_linear 2 1 8 9 10
Reshape_t layer0_att_q_reshape 1 1 10 11 0=3 1=-1 2=12 3=64
Posenc_t layer0_att_q_posenc 3 1 11 freqs_cos freqs_sin 12 0=1
MemoryData_t layer0_att_wk_weight 0 1 13 0=2 1=768 2=768 3=25166592
Matmul_t layer0_att_k_linear 2 1 8 13 14
Concat_t layer0_att_k_concat 2 1 k_cache_0 14 15 0=0
Reshape_t layer0_att_k_reshape 1 1 15 16 0=3 1=-1 2=12 3=64
Posenc_t layer0_att_k_posenc 3 1 16 freqs_cos freqs_sin 17 0=0
Matmul_t layer0_att_qk_matmul 2 1 17 12 18
BinaryOp_t layer0_att_qk_div 1 1 18 19 0=Div 1=Param 2=8
Softmax_t layer0_att_qk_softmax 1 1 19 20 0=0
MemoryData_t layer0_att_wv_weight 0 1 21 0=2 1=768 2=768 3=25756416
Matmul_t layer0_att_v_linear 2 1 8 21 22
Concat_t layer0_att_v_concat 2 1 v_cache_0 22 23 0=0
Reshape_t layer0_att_v_reshape 1 1 23 24 0=3 1=-1 2=12 3=64
Matmul_t layer0_att_qkv_matmul 2 1 24 20 25
Reshape_t layer0_att_qkv_reshape 1 1 25 26 0=2 1=-1 2=768
MemoryData_t layer0_att_wo_weight 0 1 27 0=2 1=768 2=768 3=26346240
Matmul_t layer0_att_wo_matmul 2 1 26 27 28
BinaryOp_t layer0_att_shortcut 2 1 1 28 29 0=Add 1=Tensor
UnaryOp_t layer0_ffnnorm_square 1 1 29 30 0=Square
Reduction_t layer0_ffnnorm_mean 1 1 30 31 0=Mean 1=1
BinaryOp_t layer0_ffnnorm_add 1 1 31 32 0=Add 1=Param 2=1e-06
UnaryOp_t layer0_ffnnorm_rsq 1 1 32 33 0=Rsq
BinaryOp_t layer0_ffnnorm_mul1 2 1 29 33 34 0=Mul 1=Tensor
MemoryData_t layer0_ffnnorm_weight 0 1 35 0=1 1=768 2=26936064
BinaryOp_t layer0_ffnnorm_mul2 2 1 34 35 36 0=Mul 1=Tensor
MemoryData_t layer0_ffn_w1_weight 0 1 37 0=2 1=2268 2=768 3=26936832
Matmul_t layer0_ffn_w1_matmul 2 1 36 37 38
Swish_t layer0_ffn_w1_swish 1 1 38 39
MemoryData_t layer0_ffn_w3_weight 0 1 40 0=2 1=2268 2=768 3=28678656
Matmul_t layer0_ffn_w3_matmul 2 1 36 40 41
BinaryOp_t layer0_ffn_mul 2 1 39 41 42 0=Mul 1=Tensor
MemoryData_t layer0_ffn_w2_weight 0 1 43 0=2 1=768 2=2268 3=30420480
Matmul_t layer0_ffn_w2_matmul 2 1 42 43 44
BinaryOp_t layer0_ffn_shortcut 2 1 29 44 45 0=Add 1=Tensor
UnaryOp_t layer1_attnorm_square 1 1 45 46 0=Square
Reduction_t layer1_attnorm_mean 1 1 46 47 0=Mean 1=1
BinaryOp_t layer1_attnorm_add 1 1 47 48 0=Add 1=Param 2=1e-06
UnaryOp_t layer1_attnorm_rsq 1 1 48 49 0=Rsq
BinaryOp_t layer1_attnorm_mul1 2 1 45 49 50 0=Mul 1=Tensor
MemoryData_t layer1_attnorm_weight 0 1 51 0=1 1=768 2=32162304
BinaryOp_t layer1_attnorm_mul2 2 1 50 51 52 0=Mul 1=Tensor
MemoryData_t layer1_att_wq_weight 0 1 53 0=2 1=768 2=768 3=32163072
Matmul_t layer1_att_q_linear 2 1 52 53 54
Reshape_t layer1_att_q_reshape 1 1 54 55 0=3 1=-1 2=12 3=64
Posenc_t layer1_att_q_posenc 3 1 55 freqs_cos freqs_sin 56 0=1
MemoryData_t layer1_att_wk_weight 0 1 57 0=2 1=768 2=768 3=32752896
Matmul_t layer1_att_k_linear 2 1 52 57 58
Concat_t layer1_att_k_concat 2 1 k_cache_1 58 59 0=0
Reshape_t layer1_att_k_reshape 1 1 59 60 0=3 1=-1 2=12 3=64
Posenc_t layer1_att_k_posenc 3 1 60 freqs_cos freqs_sin 61 0=0
Matmul_t layer1_att_qk_matmul 2 1 61 56 62
BinaryOp_t layer1_att_qk_div 1 1 62 63 0=Div 1=Param 2=8
Softmax_t layer1_att_qk_softmax 1 1 63 64 0=0
MemoryData_t layer1_att_wv_weight 0 1 65 0=2 1=768 2=768 3=33342720
Matmul_t layer1_att_v_linear 2 1 52 65 66
Concat_t layer1_att_v_concat 2 1 v_cache_1 66 67 0=0
Reshape_t layer1_att_v_reshape 1 1 67 68 0=3 1=-1 2=12 3=64
Matmul_t layer1_att_qkv_matmul 2 1 68 64 69
Reshape_t layer1_att_qkv_reshape 1 1 69 70 0=2 1=-1 2=768
MemoryData_t layer1_att_wo_weight 0 1 71 0=2 1=768 2=768 3=33932544
Matmul_t layer1_att_wo_matmul 2 1 70 71 72
BinaryOp_t layer1_att_shortcut 2 1 45 72 73 0=Add 1=Tensor
UnaryOp_t layer1_ffnnorm_square 1 1 73 74 0=Square
Reduction_t layer1_ffnnorm_mean 1 1 74 75 0=Mean 1=1
BinaryOp_t layer1_ffnnorm_add 1 1 75 76 0=Add 1=Param 2=1e-06
UnaryOp_t layer1_ffnnorm_rsq 1 1 76 77 0=Rsq
BinaryOp_t layer1_ffnnorm_mul1 2 1 73 77 78 0=Mul 1=Tensor
MemoryData_t layer1_ffnnorm_weight 0 1 79 0=1 1=768 2=34522368
BinaryOp_t layer1_ffnnorm_mul2 2 1 78 79 80 0=Mul 1=Tensor
MemoryData_t layer1_ffn_w1_weight 0 1 81 0=2 1=2268 2=768 3=34523136
Matmul_t layer1_ffn_w1_matmul 2 1 80 81 82
Swish_t layer1_ffn_w1_swish 1 1 82 83
MemoryData_t layer1_ffn_w3_weight 0 1 84 0=2 1=2268 2=768 3=36264960
Matmul_t layer1_ffn_w3_matmul 2 1 80 84 85
BinaryOp_t layer1_ffn_mul 2 1 83 85 86 0=Mul 1=Tensor
MemoryData_t layer1_ffn_w2_weight 0 1 87 0=2 1=768 2=2268 3=38006784
Matmul_t layer1_ffn_w2_matmul 2 1 86 87 88
BinaryOp_t layer1_ffn_shortcut 2 1 73 88 89 0=Add 1=Tensor
UnaryOp_t layer2_attnorm_square 1 1 89 90 0=Square
Reduction_t layer2_attnorm_mean 1 1 90 91 0=Mean 1=1
BinaryOp_t layer2_attnorm_add 1 1 91 92 0=Add 1=Param 2=1e-06
UnaryOp_t layer2_attnorm_rsq 1 1 92 93 0=Rsq
BinaryOp_t layer2_attnorm_mul1 2 1 89 93 94 0=Mul 1=Tensor
MemoryData_t layer2_attnorm_weight 0 1 95 0=1 1=768 2=39748608
BinaryOp_t layer2_attnorm_mul2 2 1 94 95 96 0=Mul 1=Tensor
MemoryData_t layer2_att_wq_weight 0 1 97 0=2 1=768 2=768 3=39749376
Matmul_t layer2_att_q_linear 2 1 96 97 98
Reshape_t layer2_att_q_reshape 1 1 98 99 0=3 1=-1 2=12 3=64
Posenc_t layer2_att_q_posenc 3 1 99 freqs_cos freqs_sin 100 0=1
MemoryData_t layer2_att_wk_weight 0 1 101 0=2 1=768 2=768 3=40339200
Matmul_t layer2_att_k_linear 2 1 96 101 102
Concat_t layer2_att_k_concat 2 1 k_cache_2 102 103 0=0
Reshape_t layer2_att_k_reshape 1 1 103 104 0=3 1=-1 2=12 3=64
Posenc_t layer2_att_k_posenc 3 1 104 freqs_cos freqs_sin 105 0=0
Matmul_t layer2_att_qk_matmul 2 1 105 100 106
BinaryOp_t layer2_att_qk_div 1 1 106 107 0=Div 1=Param 2=8
Softmax_t layer2_att_qk_softmax 1 1 107 108 0=0
MemoryData_t layer2_att_wv_weight 0 1 109 0=2 1=768 2=768 3=40929024
Matmul_t layer2_att_v_linear 2 1 96 109 110
Concat_t layer2_att_v_concat 2 1 v_cache_2 110 111 0=0
Reshape_t layer2_att_v_reshape 1 1 111 112 0=3 1=-1 2=12 3=64
Matmul_t layer2_att_qkv_matmul 2 1 112 108 113
Reshape_t layer2_att_qkv_reshape 1 1 113 114 0=2 1=-1 2=768
MemoryData_t layer2_att_wo_weight 0 1 115 0=2 1=768 2=768 3=41518848
Matmul_t layer2_att_wo_matmul 2 1 114 115 116
BinaryOp_t layer2_att_shortcut 2 1 89 116 117 0=Add 1=Tensor
UnaryOp_t layer2_ffnnorm_square 1 1 117 118 0=Square
Reduction_t layer2_ffnnorm_mean 1 1 118 119 0=Mean 1=1
BinaryOp_t layer2_ffnnorm_add 1 1 119 120 0=Add 1=Param 2=1e-06
UnaryOp_t layer2_ffnnorm_rsq 1 1 120 121 0=Rsq
BinaryOp_t layer2_ffnnorm_mul1 2 1 117 121 122 0=Mul 1=Tensor
MemoryData_t layer2_ffnnorm_weight 0 1 123 0=1 1=768 2=42108672
BinaryOp_t layer2_ffnnorm_mul2 2 1 122 123 124 0=Mul 1=Tensor
MemoryData_t layer2_ffn_w1_weight 0 1 125 0=2 1=2268 2=768 3=42109440
Matmul_t layer2_ffn_w1_matmul 2 1 124 125 126
Swish_t layer2_ffn_w1_swish 1 1 126 127
MemoryData_t layer2_ffn_w3_weight 0 1 128 0=2 1=2268 2=768 3=43851264
Matmul_t layer2_ffn_w3_matmul 2 1 124 128 129
BinaryOp_t layer2_ffn_mul 2 1 127 129 130 0=Mul 1=Tensor
MemoryData_t layer2_ffn_w2_weight 0 1 131 0=2 1=768 2=2268 3=45593088
Matmul_t layer2_ffn_w2_matmul 2 1 130 131 132
BinaryOp_t layer2_ffn_shortcut 2 1 117 132 133 0=Add 1=Tensor
UnaryOp_t layer3_attnorm_square 1 1 133 134 0=Square
Reduction_t layer3_attnorm_mean 1 1 134 135 0=Mean 1=1
BinaryOp_t layer3_attnorm_add 1 1 135 136 0=Add 1=Param 2=1e-06
UnaryOp_t layer3_attnorm_rsq 1 1 136 137 0=Rsq
BinaryOp_t layer3_attnorm_mul1 2 1 133 137 138 0=Mul 1=Tensor
MemoryData_t layer3_attnorm_weight 0 1 139 0=1 1=768 2=47334912
BinaryOp_t layer3_attnorm_mul2 2 1 138 139 140 0=Mul 1=Tensor
MemoryData_t layer3_att_wq_weight 0 1 141 0=2 1=768 2=768 3=47335680
Matmul_t layer3_att_q_linear 2 1 140 141 142
Reshape_t layer3_att_q_reshape 1 1 142 143 0=3 1=-1 2=12 3=64
Posenc_t layer3_att_q_posenc 3 1 143 freqs_cos freqs_sin 144 0=1
MemoryData_t layer3_att_wk_weight 0 1 145 0=2 1=768 2=768 3=47925504
Matmul_t layer3_att_k_linear 2 1 140 145 146
Concat_t layer3_att_k_concat 2 1 k_cache_3 146 147 0=0
Reshape_t layer3_att_k_reshape 1 1 147 148 0=3 1=-1 2=12 3=64
Posenc_t layer3_att_k_posenc 3 1 148 freqs_cos freqs_sin 149 0=0
Matmul_t layer3_att_qk_matmul 2 1 149 144 150
BinaryOp_t layer3_att_qk_div 1 1 150 151 0=Div 1=Param 2=8
Softmax_t layer3_att_qk_softmax 1 1 151 152 0=0
MemoryData_t layer3_att_wv_weight 0 1 153 0=2 1=768 2=768 3=48515328
Matmul_t layer3_att_v_linear 2 1 140 153 154
Concat_t layer3_att_v_concat 2 1 v_cache_3 154 155 0=0
Reshape_t layer3_att_v_reshape 1 1 155 156 0=3 1=-1 2=12 3=64
Matmul_t layer3_att_qkv_matmul 2 1 156 152 157
Reshape_t layer3_att_qkv_reshape 1 1 157 158 0=2 1=-1 2=768
MemoryData_t layer3_att_wo_weight 0 1 159 0=2 1=768 2=768 3=49105152
Matmul_t layer3_att_wo_matmul 2 1 158 159 160
BinaryOp_t layer3_att_shortcut 2 1 133 160 161 0=Add 1=Tensor
UnaryOp_t layer3_ffnnorm_square 1 1 161 162 0=Square
Reduction_t layer3_ffnnorm_mean 1 1 162 163 0=Mean 1=1
BinaryOp_t layer3_ffnnorm_add 1 1 163 164 0=Add 1=Param 2=1e-06
UnaryOp_t layer3_ffnnorm_rsq 1 1 164 165 0=Rsq
BinaryOp_t layer3_ffnnorm_mul1 2 1 161 165 166 0=Mul 1=Tensor
MemoryData_t layer3_ffnnorm_weight 0 1 167 0=1 1=768 2=49694976
BinaryOp_t layer3_ffnnorm_mul2 2 1 166 167 168 0=Mul 1=Tensor
MemoryData_t layer3_ffn_w1_weight 0 1 169 0=2 1=2268 2=768 3=49695744
Matmul_t layer3_ffn_w1_matmul 2 1 168 169 170
Swish_t layer3_ffn_w1_swish 1 1 170 171
MemoryData_t layer3_ffn_w3_weight 0 1 172 0=2 1=2268 2=768 3=51437568
Matmul_t layer3_ffn_w3_matmul 2 1 168 172 173
BinaryOp_t layer3_ffn_mul 2 1 171 173 174 0=Mul 1=Tensor
MemoryData_t layer3_ffn_w2_weight 0 1 175 0=2 1=768 2=2268 3=53179392
Matmul_t layer3_ffn_w2_matmul 2 1 174 175 176
BinaryOp_t layer3_ffn_shortcut 2 1 161 176 177 0=Add 1=Tensor
UnaryOp_t layer4_attnorm_square 1 1 177 178 0=Square
Reduction_t layer4_attnorm_mean 1 1 178 179 0=Mean 1=1
BinaryOp_t layer4_attnorm_add 1 1 179 180 0=Add 1=Param 2=1e-06
UnaryOp_t layer4_attnorm_rsq 1 1 180 181 0=Rsq
BinaryOp_t layer4_attnorm_mul1 2 1 177 181 182 0=Mul 1=Tensor
MemoryData_t layer4_attnorm_weight 0 1 183 0=1 1=768 2=54921216
BinaryOp_t layer4_attnorm_mul2 2 1 182 183 184 0=Mul 1=Tensor
MemoryData_t layer4_att_wq_weight 0 1 185 0=2 1=768 2=768 3=54921984
Matmul_t layer4_att_q_linear 2 1 184 185 186
Reshape_t layer4_att_q_reshape 1 1 186 187 0=3 1=-1 2=12 3=64
Posenc_t layer4_att_q_posenc 3 1 187 freqs_cos freqs_sin 188 0=1
MemoryData_t layer4_att_wk_weight 0 1 189 0=2 1=768 2=768 3=55511808
Matmul_t layer4_att_k_linear 2 1 184 189 190
Concat_t layer4_att_k_concat 2 1 k_cache_4 190 191 0=0
Reshape_t layer4_att_k_reshape 1 1 191 192 0=3 1=-1 2=12 3=64
Posenc_t layer4_att_k_posenc 3 1 192 freqs_cos freqs_sin 193 0=0
Matmul_t layer4_att_qk_matmul 2 1 193 188 194
BinaryOp_t layer4_att_qk_div 1 1 194 195 0=Div 1=Param 2=8
Softmax_t layer4_att_qk_softmax 1 1 195 196 0=0
MemoryData_t layer4_att_wv_weight 0 1 197 0=2 1=768 2=768 3=56101632
Matmul_t layer4_att_v_linear 2 1 184 197 198
Concat_t layer4_att_v_concat 2 1 v_cache_4 198 199 0=0
Reshape_t layer4_att_v_reshape 1 1 199 200 0=3 1=-1 2=12 3=64
Matmul_t layer4_att_qkv_matmul 2 1 200 196 201
Reshape_t layer4_att_qkv_reshape 1 1 201 202 0=2 1=-1 2=768
MemoryData_t layer4_att_wo_weight 0 1 203 0=2 1=768 2=768 3=56691456
Matmul_t layer4_att_wo_matmul 2 1 202 203 204
BinaryOp_t layer4_att_shortcut 2 1 177 204 205 0=Add 1=Tensor
UnaryOp_t layer4_ffnnorm_square 1 1 205 206 0=Square
Reduction_t layer4_ffnnorm_mean 1 1 206 207 0=Mean 1=1
BinaryOp_t layer4_ffnnorm_add 1 1 207 208 0=Add 1=Param 2=1e-06
UnaryOp_t layer4_ffnnorm_rsq 1 1 208 209 0=Rsq
BinaryOp_t layer4_ffnnorm_mul1 2 1 205 209 210 0=Mul 1=Tensor
MemoryData_t layer4_ffnnorm_weight 0 1 211 0=1 1=768 2=57281280
BinaryOp_t layer4_ffnnorm_mul2 2 1 210 211 212 0=Mul 1=Tensor
MemoryData_t layer4_ffn_w1_weight 0 1 213 0=2 1=2268 2=768 3=57282048
Matmul_t layer4_ffn_w1_matmul 2 1 212 213 214
Swish_t layer4_ffn_w1_swish 1 1 214 215
MemoryData_t layer4_ffn_w3_weight 0 1 216 0=2 1=2268 2=768 3=59023872
Matmul_t layer4_ffn_w3_matmul 2 1 212 216 217
BinaryOp_t layer4_ffn_mul 2 1 215 217 218 0=Mul 1=Tensor
MemoryData_t layer4_ffn_w2_weight 0 1 219 0=2 1=768 2=2268 3=60765696
Matmul_t layer4_ffn_w2_matmul 2 1 218 219 220
BinaryOp_t layer4_ffn_shortcut 2 1 205 220 221 0=Add 1=Tensor
UnaryOp_t layer5_attnorm_square 1 1 221 222 0=Square
Reduction_t layer5_attnorm_mean 1 1 222 223 0=Mean 1=1
BinaryOp_t layer5_attnorm_add 1 1 223 224 0=Add 1=Param 2=1e-06
UnaryOp_t layer5_attnorm_rsq 1 1 224 225 0=Rsq
BinaryOp_t layer5_attnorm_mul1 2 1 221 225 226 0=Mul 1=Tensor
MemoryData_t layer5_attnorm_weight 0 1 227 0=1 1=768 2=62507520
BinaryOp_t layer5_attnorm_mul2 2 1 226 227 228 0=Mul 1=Tensor
MemoryData_t layer5_att_wq_weight 0 1 229 0=2 1=768 2=768 3=62508288
Matmul_t layer5_att_q_linear 2 1 228 229 230
Reshape_t layer5_att_q_reshape 1 1 230 231 0=3 1=-1 2=12 3=64
Posenc_t layer5_att_q_posenc 3 1 231 freqs_cos freqs_sin 232 0=1
MemoryData_t layer5_att_wk_weight 0 1 233 0=2 1=768 2=768 3=63098112
Matmul_t layer5_att_k_linear 2 1 228 233 234
Concat_t layer5_att_k_concat 2 1 k_cache_5 234 235 0=0
Reshape_t layer5_att_k_reshape 1 1 235 236 0=3 1=-1 2=12 3=64
Posenc_t layer5_att_k_posenc 3 1 236 freqs_cos freqs_sin 237 0=0
Matmul_t layer5_att_qk_matmul 2 1 237 232 238
BinaryOp_t layer5_att_qk_div 1 1 238 239 0=Div 1=Param 2=8
Softmax_t layer5_att_qk_softmax 1 1 239 240 0=0
MemoryData_t layer5_att_wv_weight 0 1 241 0=2 1=768 2=768 3=63687936
Matmul_t layer5_att_v_linear 2 1 228 241 242
Concat_t layer5_att_v_concat 2 1 v_cache_5 242 243 0=0
Reshape_t layer5_att_v_reshape 1 1 243 244 0=3 1=-1 2=12 3=64
Matmul_t layer5_att_qkv_matmul 2 1 244 240 245
Reshape_t layer5_att_qkv_reshape 1 1 245 246 0=2 1=-1 2=768
MemoryData_t layer5_att_wo_weight 0 1 247 0=2 1=768 2=768 3=64277760
Matmul_t layer5_att_wo_matmul 2 1 246 247 248
BinaryOp_t layer5_att_shortcut 2 1 221 248 249 0=Add 1=Tensor
UnaryOp_t layer5_ffnnorm_square 1 1 249 250 0=Square
Reduction_t layer5_ffnnorm_mean 1 1 250 251 0=Mean 1=1
BinaryOp_t layer5_ffnnorm_add 1 1 251 252 0=Add 1=Param 2=1e-06
UnaryOp_t layer5_ffnnorm_rsq 1 1 252 253 0=Rsq
BinaryOp_t layer5_ffnnorm_mul1 2 1 249 253 254 0=Mul 1=Tensor
MemoryData_t layer5_ffnnorm_weight 0 1 255 0=1 1=768 2=64867584
BinaryOp_t layer5_ffnnorm_mul2 2 1 254 255 256 0=Mul 1=Tensor
MemoryData_t layer5_ffn_w1_weight 0 1 257 0=2 1=2268 2=768 3=64868352
Matmul_t layer5_ffn_w1_matmul 2 1 256 257 258
Swish_t layer5_ffn_w1_swish 1 1 258 259
MemoryData_t layer5_ffn_w3_weight 0 1 260 0=2 1=2268 2=768 3=66610176
Matmul_t layer5_ffn_w3_matmul 2 1 256 260 261
BinaryOp_t layer5_ffn_mul 2 1 259 261 262 0=Mul 1=Tensor
MemoryData_t layer5_ffn_w2_weight 0 1 263 0=2 1=768 2=2268 3=68352000
Matmul_t layer5_ffn_w2_matmul 2 1 262 263 264
BinaryOp_t layer5_ffn_shortcut 2 1 249 264 265 0=Add 1=Tensor
UnaryOp_t layer6_attnorm_square 1 1 265 266 0=Square
Reduction_t layer6_attnorm_mean 1 1 266 267 0=Mean 1=1
BinaryOp_t layer6_attnorm_add 1 1 267 268 0=Add 1=Param 2=1e-06
UnaryOp_t layer6_attnorm_rsq 1 1 268 269 0=Rsq
BinaryOp_t layer6_attnorm_mul1 2 1 265 269 270 0=Mul 1=Tensor
MemoryData_t layer6_attnorm_weight 0 1 271 0=1 1=768 2=70093824
BinaryOp_t layer6_attnorm_mul2 2 1 270 271 272 0=Mul 1=Tensor
MemoryData_t layer6_att_wq_weight 0 1 273 0=2 1=768 2=768 3=70094592
Matmul_t layer6_att_q_linear 2 1 272 273 274
Reshape_t layer6_att_q_reshape 1 1 274 275 0=3 1=-1 2=12 3=64
Posenc_t layer6_att_q_posenc 3 1 275 freqs_cos freqs_sin 276 0=1
MemoryData_t layer6_att_wk_weight 0 1 277 0=2 1=768 2=768 3=70684416
Matmul_t layer6_att_k_linear 2 1 272 277 278
Concat_t layer6_att_k_concat 2 1 k_cache_6 278 279 0=0
Reshape_t layer6_att_k_reshape 1 1 279 280 0=3 1=-1 2=12 3=64
Posenc_t layer6_att_k_posenc 3 1 280 freqs_cos freqs_sin 281 0=0
Matmul_t layer6_att_qk_matmul 2 1 281 276 282
BinaryOp_t layer6_att_qk_div 1 1 282 283 0=Div 1=Param 2=8
Softmax_t layer6_att_qk_softmax 1 1 283 284 0=0
MemoryData_t layer6_att_wv_weight 0 1 285 0=2 1=768 2=768 3=71274240
Matmul_t layer6_att_v_linear 2 1 272 285 286
Concat_t layer6_att_v_concat 2 1 v_cache_6 286 287 0=0
Reshape_t layer6_att_v_reshape 1 1 287 288 0=3 1=-1 2=12 3=64
Matmul_t layer6_att_qkv_matmul 2 1 288 284 289
Reshape_t layer6_att_qkv_reshape 1 1 289 290 0=2 1=-1 2=768
MemoryData_t layer6_att_wo_weight 0 1 291 0=2 1=768 2=768 3=71864064
Matmul_t layer6_att_wo_matmul 2 1 290 291 292
BinaryOp_t layer6_att_shortcut 2 1 265 292 293 0=Add 1=Tensor
UnaryOp_t layer6_ffnnorm_square 1 1 293 294 0=Square
Reduction_t layer6_ffnnorm_mean 1 1 294 295 0=Mean 1=1
BinaryOp_t layer6_ffnnorm_add 1 1 295 296 0=Add 1=Param 2=1e-06
UnaryOp_t layer6_ffnnorm_rsq 1 1 296 297 0=Rsq
BinaryOp_t layer6_ffnnorm_mul1 2 1 293 297 298 0=Mul 1=Tensor
MemoryData_t layer6_ffnnorm_weight 0 1 299 0=1 1=768 2=72453888
BinaryOp_t layer6_ffnnorm_mul2 2 1 298 299 300 0=Mul 1=Tensor
MemoryData_t layer6_ffn_w1_weight 0 1 301 0=2 1=2268 2=768 3=72454656
Matmul_t layer6_ffn_w1_matmul 2 1 300 301 302
Swish_t layer6_ffn_w1_swish 1 1 302 303
MemoryData_t layer6_ffn_w3_weight 0 1 304 0=2 1=2268 2=768 3=74196480
Matmul_t layer6_ffn_w3_matmul 2 1 300 304 305
BinaryOp_t layer6_ffn_mul 2 1 303 305 306 0=Mul 1=Tensor
MemoryData_t layer6_ffn_w2_weight 0 1 307 0=2 1=768 2=2268 3=75938304
Matmul_t layer6_ffn_w2_matmul 2 1 306 307 308
BinaryOp_t layer6_ffn_shortcut 2 1 293 308 309 0=Add 1=Tensor
UnaryOp_t layer7_attnorm_square 1 1 309 310 0=Square
Reduction_t layer7_attnorm_mean 1 1 310 311 0=Mean 1=1
BinaryOp_t layer7_attnorm_add 1 1 311 312 0=Add 1=Param 2=1e-06
UnaryOp_t layer7_attnorm_rsq 1 1 312 313 0=Rsq
BinaryOp_t layer7_attnorm_mul1 2 1 309 313 314 0=Mul 1=Tensor
MemoryData_t layer7_attnorm_weight 0 1 315 0=1 1=768 2=77680128
BinaryOp_t layer7_attnorm_mul2 2 1 314 315 316 0=Mul 1=Tensor
MemoryData_t layer7_att_wq_weight 0 1 317 0=2 1=768 2=768 3=77680896
Matmul_t layer7_att_q_linear 2 1 316 317 318
Reshape_t layer7_att_q_reshape 1 1 318 319 0=3 1=-1 2=12 3=64
Posenc_t layer7_att_q_posenc 3 1 319 freqs_cos freqs_sin 320 0=1
MemoryData_t layer7_att_wk_weight 0 1 321 0=2 1=768 2=768 3=78270720
Matmul_t layer7_att_k_linear 2 1 316 321 322
Concat_t layer7_att_k_concat 2 1 k_cache_7 322 323 0=0
Reshape_t layer7_att_k_reshape 1 1 323 324 0=3 1=-1 2=12 3=64
Posenc_t layer7_att_k_posenc 3 1 324 freqs_cos freqs_sin 325 0=0
Matmul_t layer7_att_qk_matmul 2 1 325 320 326
BinaryOp_t layer7_att_qk_div 1 1 326 327 0=Div 1=Param 2=8
Softmax_t layer7_att_qk_softmax 1 1 327 328 0=0
MemoryData_t layer7_att_wv_weight 0 1 329 0=2 1=768 2=768 3=78860544
Matmul_t layer7_att_v_linear 2 1 316 329 330
Concat_t layer7_att_v_concat 2 1 v_cache_7 330 331 0=0
Reshape_t layer7_att_v_reshape 1 1 331 332 0=3 1=-1 2=12 3=64
Matmul_t layer7_att_qkv_matmul 2 1 332 328 333
Reshape_t layer7_att_qkv_reshape 1 1 333 334 0=2 1=-1 2=768
MemoryData_t layer7_att_wo_weight 0 1 335 0=2 1=768 2=768 3=79450368
Matmul_t layer7_att_wo_matmul 2 1 334 335 336
BinaryOp_t layer7_att_shortcut 2 1 309 336 337 0=Add 1=Tensor
UnaryOp_t layer7_ffnnorm_square 1 1 337 338 0=Square
Reduction_t layer7_ffnnorm_mean 1 1 338 339 0=Mean 1=1
BinaryOp_t layer7_ffnnorm_add 1 1 339 340 0=Add 1=Param 2=1e-06
UnaryOp_t layer7_ffnnorm_rsq 1 1 340 341 0=Rsq
BinaryOp_t layer7_ffnnorm_mul1 2 1 337 341 342 0=Mul 1=Tensor
MemoryData_t layer7_ffnnorm_weight 0 1 343 0=1 1=768 2=80040192
BinaryOp_t layer7_ffnnorm_mul2 2 1 342 343 344 0=Mul 1=Tensor
MemoryData_t layer7_ffn_w1_weight 0 1 345 0=2 1=2268 2=768 3=80040960
Matmul_t layer7_ffn_w1_matmul 2 1 344 345 346
Swish_t layer7_ffn_w1_swish 1 1 346 347
MemoryData_t layer7_ffn_w3_weight 0 1 348 0=2 1=2268 2=768 3=81782784
Matmul_t layer7_ffn_w3_matmul 2 1 344 348 349
BinaryOp_t layer7_ffn_mul 2 1 347 349 350 0=Mul 1=Tensor
MemoryData_t layer7_ffn_w2_weight 0 1 351 0=2 1=768 2=2268 3=83524608
Matmul_t layer7_ffn_w2_matmul 2 1 350 351 352
BinaryOp_t layer7_ffn_shortcut 2 1 337 352 353 0=Add 1=Tensor
UnaryOp_t layer8_attnorm_square 1 1 353 354 0=Square
Reduction_t layer8_attnorm_mean 1 1 354 355 0=Mean 1=1
BinaryOp_t layer8_attnorm_add 1 1 355 356 0=Add 1=Param 2=1e-06
UnaryOp_t layer8_attnorm_rsq 1 1 356 357 0=Rsq
BinaryOp_t layer8_attnorm_mul1 2 1 353 357 358 0=Mul 1=Tensor
MemoryData_t layer8_attnorm_weight 0 1 359 0=1 1=768 2=85266432
BinaryOp_t layer8_attnorm_mul2 2 1 358 359 360 0=Mul 1=Tensor
MemoryData_t layer8_att_wq_weight 0 1 361 0=2 1=768 2=768 3=85267200
Matmul_t layer8_att_q_linear 2 1 360 361 362
Reshape_t layer8_att_q_reshape 1 1 362 363 0=3 1=-1 2=12 3=64
Posenc_t layer8_att_q_posenc 3 1 363 freqs_cos freqs_sin 364 0=1
MemoryData_t layer8_att_wk_weight 0 1 365 0=2 1=768 2=768 3=85857024
Matmul_t layer8_att_k_linear 2 1 360 365 366
Concat_t layer8_att_k_concat 2 1 k_cache_8 366 367 0=0
Reshape_t layer8_att_k_reshape 1 1 367 368 0=3 1=-1 2=12 3=64
Posenc_t layer8_att_k_posenc 3 1 368 freqs_cos freqs_sin 369 0=0
Matmul_t layer8_att_qk_matmul 2 1 369 364 370
BinaryOp_t layer8_att_qk_div 1 1 370 371 0=Div 1=Param 2=8
Softmax_t layer8_att_qk_softmax 1 1 371 372 0=0
MemoryData_t layer8_att_wv_weight 0 1 373 0=2 1=768 2=768 3=86446848
Matmul_t layer8_att_v_linear 2 1 360 373 374
Concat_t layer8_att_v_concat 2 1 v_cache_8 374 375 0=0
Reshape_t layer8_att_v_reshape 1 1 375 376 0=3 1=-1 2=12 3=64
Matmul_t layer8_att_qkv_matmul 2 1 376 372 377
Reshape_t layer8_att_qkv_reshape 1 1 377 378 0=2 1=-1 2=768
MemoryData_t layer8_att_wo_weight 0 1 379 0=2 1=768 2=768 3=87036672
Matmul_t layer8_att_wo_matmul 2 1 378 379 380
BinaryOp_t layer8_att_shortcut 2 1 353 380 381 0=Add 1=Tensor
UnaryOp_t layer8_ffnnorm_square 1 1 381 382 0=Square
Reduction_t layer8_ffnnorm_mean 1 1 382 383 0=Mean 1=1
BinaryOp_t layer8_ffnnorm_add 1 1 383 384 0=Add 1=Param 2=1e-06
UnaryOp_t layer8_ffnnorm_rsq 1 1 384 385 0=Rsq
BinaryOp_t layer8_ffnnorm_mul1 2 1 381 385 386 0=Mul 1=Tensor
MemoryData_t layer8_ffnnorm_weight 0 1 387 0=1 1=768 2=87626496
BinaryOp_t layer8_ffnnorm_mul2 2 1 386 387 388 0=Mul 1=Tensor
MemoryData_t layer8_ffn_w1_weight 0 1 389 0=2 1=2268 2=768 3=87627264
Matmul_t layer8_ffn_w1_matmul 2 1 388 389 390
Swish_t layer8_ffn_w1_swish 1 1 390 391
MemoryData_t layer8_ffn_w3_weight 0 1 392 0=2 1=2268 2=768 3=89369088
Matmul_t layer8_ffn_w3_matmul 2 1 388 392 393
BinaryOp_t layer8_ffn_mul 2 1 391 393 394 0=Mul 1=Tensor
MemoryData_t layer8_ffn_w2_weight 0 1 395 0=2 1=768 2=2268 3=91110912
Matmul_t layer8_ffn_w2_matmul 2 1 394 395 396
BinaryOp_t layer8_ffn_shortcut 2 1 381 396 397 0=Add 1=Tensor
UnaryOp_t layer9_attnorm_square 1 1 397 398 0=Square
Reduction_t layer9_attnorm_mean 1 1 398 399 0=Mean 1=1
BinaryOp_t layer9_attnorm_add 1 1 399 400 0=Add 1=Param 2=1e-06
UnaryOp_t layer9_attnorm_rsq 1 1 400 401 0=Rsq
BinaryOp_t layer9_attnorm_mul1 2 1 397 401 402 0=Mul 1=Tensor
MemoryData_t layer9_attnorm_weight 0 1 403 0=1 1=768 2=92852736
BinaryOp_t layer9_attnorm_mul2 2 1 402 403 404 0=Mul 1=Tensor
MemoryData_t layer9_att_wq_weight 0 1 405 0=2 1=768 2=768 3=92853504
Matmul_t layer9_att_q_linear 2 1 404 405 406
Reshape_t layer9_att_q_reshape 1 1 406 407 0=3 1=-1 2=12 3=64
Posenc_t layer9_att_q_posenc 3 1 407 freqs_cos freqs_sin 408 0=1
MemoryData_t layer9_att_wk_weight 0 1 409 0=2 1=768 2=768 3=93443328
Matmul_t layer9_att_k_linear 2 1 404 409 410
Concat_t layer9_att_k_concat 2 1 k_cache_9 410 411 0=0
Reshape_t layer9_att_k_reshape 1 1 411 412 0=3 1=-1 2=12 3=64
Posenc_t layer9_att_k_posenc 3 1 412 freqs_cos freqs_sin 413 0=0
Matmul_t layer9_att_qk_matmul 2 1 413 408 414
BinaryOp_t layer9_att_qk_div 1 1 414 415 0=Div 1=Param 2=8
Softmax_t layer9_att_qk_softmax 1 1 415 416 0=0
MemoryData_t layer9_att_wv_weight 0 1 417 0=2 1=768 2=768 3=94033152
Matmul_t layer9_att_v_linear 2 1 404 417 418
Concat_t layer9_att_v_concat 2 1 v_cache_9 418 419 0=0
Reshape_t layer9_att_v_reshape 1 1 419 420 0=3 1=-1 2=12 3=64
Matmul_t layer9_att_qkv_matmul 2 1 420 416 421
Reshape_t layer9_att_qkv_reshape 1 1 421 422 0=2 1=-1 2=768
MemoryData_t layer9_att_wo_weight 0 1 423 0=2 1=768 2=768 3=94622976
Matmul_t layer9_att_wo_matmul 2 1 422 423 424
BinaryOp_t layer9_att_shortcut 2 1 397 424 425 0=Add 1=Tensor
UnaryOp_t layer9_ffnnorm_square 1 1 425 426 0=Square
Reduction_t layer9_ffnnorm_mean 1 1 426 427 0=Mean 1=1
BinaryOp_t layer9_ffnnorm_add 1 1 427 428 0=Add 1=Param 2=1e-06
UnaryOp_t layer9_ffnnorm_rsq 1 1 428 429 0=Rsq
BinaryOp_t layer9_ffnnorm_mul1 2 1 425 429 430 0=Mul 1=Tensor
MemoryData_t layer9_ffnnorm_weight 0 1 431 0=1 1=768 2=95212800
BinaryOp_t layer9_ffnnorm_mul2 2 1 430 431 432 0=Mul 1=Tensor
MemoryData_t layer9_ffn_w1_weight 0 1 433 0=2 1=2268 2=768 3=95213568
Matmul_t layer9_ffn_w1_matmul 2 1 432 433 434
Swish_t layer9_ffn_w1_swish 1 1 434 435
MemoryData_t layer9_ffn_w3_weight 0 1 436 0=2 1=2268 2=768 3=96955392
Matmul_t layer9_ffn_w3_matmul 2 1 432 436 437
BinaryOp_t layer9_ffn_mul 2 1 435 437 438 0=Mul 1=Tensor
MemoryData_t layer9_ffn_w2_weight 0 1 439 0=2 1=768 2=2268 3=98697216
Matmul_t layer9_ffn_w2_matmul 2 1 438 439 440
BinaryOp_t layer9_ffn_shortcut 2 1 425 440 441 0=Add 1=Tensor
UnaryOp_t layer10_attnorm_square 1 1 441 442 0=Square
Reduction_t layer10_attnorm_mean 1 1 442 443 0=Mean 1=1
BinaryOp_t layer10_attnorm_add 1 1 443 444 0=Add 1=Param 2=1e-06
UnaryOp_t layer10_attnorm_rsq 1 1 444 445 0=Rsq
BinaryOp_t layer10_attnorm_mul1 2 1 441 445 446 0=Mul 1=Tensor
MemoryData_t layer10_attnorm_weight 0 1 447 0=1 1=768 2=100439040
BinaryOp_t layer10_attnorm_mul2 2 1 446 447 448 0=Mul 1=Tensor
MemoryData_t layer10_att_wq_weight 0 1 449 0=2 1=768 2=768 3=100439808
Matmul_t layer10_att_q_linear 2 1 448 449 450
Reshape_t layer10_att_q_reshape 1 1 450 451 0=3 1=-1 2=12 3=64
Posenc_t layer10_att_q_posenc 3 1 451 freqs_cos freqs_sin 452 0=1
MemoryData_t layer10_att_wk_weight 0 1 453 0=2 1=768 2=768 3=101029632
Matmul_t layer10_att_k_linear 2 1 448 453 454
Concat_t layer10_att_k_concat 2 1 k_cache_10 454 455 0=0
Reshape_t layer10_att_k_reshape 1 1 455 456 0=3 1=-1 2=12 3=64
Posenc_t layer10_att_k_posenc 3 1 456 freqs_cos freqs_sin 457 0=0
Matmul_t layer10_att_qk_matmul 2 1 457 452 458
BinaryOp_t layer10_att_qk_div 1 1 458 459 0=Div 1=Param 2=8
Softmax_t layer10_att_qk_softmax 1 1 459 460 0=0
MemoryData_t layer10_att_wv_weight 0 1 461 0=2 1=768 2=768 3=101619456
Matmul_t layer10_att_v_linear 2 1 448 461 462
Concat_t layer10_att_v_concat 2 1 v_cache_10 462 463 0=0
Reshape_t layer10_att_v_reshape 1 1 463 464 0=3 1=-1 2=12 3=64
Matmul_t layer10_att_qkv_matmul 2 1 464 460 465
Reshape_t layer10_att_qkv_reshape 1 1 465 466 0=2 1=-1 2=768
MemoryData_t layer10_att_wo_weight 0 1 467 0=2 1=768 2=768 3=102209280
Matmul_t layer10_att_wo_matmul 2 1 466 467 468
BinaryOp_t layer10_att_shortcut 2 1 441 468 469 0=Add 1=Tensor
UnaryOp_t layer10_ffnnorm_square 1 1 469 470 0=Square
Reduction_t layer10_ffnnorm_mean 1 1 470 471 0=Mean 1=1
BinaryOp_t layer10_ffnnorm_add 1 1 471 472 0=Add 1=Param 2=1e-06
UnaryOp_t layer10_ffnnorm_rsq 1 1 472 473 0=Rsq
BinaryOp_t layer10_ffnnorm_mul1 2 1 469 473 474 0=Mul 1=Tensor
MemoryData_t layer10_ffnnorm_weight 0 1 475 0=1 1=768 2=102799104
BinaryOp_t layer10_ffnnorm_mul2 2 1 474 475 476 0=Mul 1=Tensor
MemoryData_t layer10_ffn_w1_weight 0 1 477 0=2 1=2268 2=768 3=102799872
Matmul_t layer10_ffn_w1_matmul 2 1 476 477 478
Swish_t layer10_ffn_w1_swish 1 1 478 479
MemoryData_t layer10_ffn_w3_weight 0 1 480 0=2 1=2268 2=768 3=104541696
Matmul_t layer10_ffn_w3_matmul 2 1 476 480 481
BinaryOp_t layer10_ffn_mul 2 1 479 481 482 0=Mul 1=Tensor
MemoryData_t layer10_ffn_w2_weight 0 1 483 0=2 1=768 2=2268 3=106283520
Matmul_t layer10_ffn_w2_matmul 2 1 482 483 484
BinaryOp_t layer10_ffn_shortcut 2 1 469 484 485 0=Add 1=Tensor
UnaryOp_t layer11_attnorm_square 1 1 485 486 0=Square
Reduction_t layer11_attnorm_mean 1 1 486 487 0=Mean 1=1
BinaryOp_t layer11_attnorm_add 1 1 487 488 0=Add 1=Param 2=1e-06
UnaryOp_t layer11_attnorm_rsq 1 1 488 489 0=Rsq
BinaryOp_t layer11_attnorm_mul1 2 1 485 489 490 0=Mul 1=Tensor
MemoryData_t layer11_attnorm_weight 0 1 491 0=1 1=768 2=108025344
BinaryOp_t layer11_attnorm_mul2 2 1 490 491 492 0=Mul 1=Tensor
MemoryData_t layer11_att_wq_weight 0 1 493 0=2 1=768 2=768 3=108026112
Matmul_t layer11_att_q_linear 2 1 492 493 494
Reshape_t layer11_att_q_reshape 1 1 494 495 0=3 1=-1 2=12 3=64
Posenc_t layer11_att_q_posenc 3 1 495 freqs_cos freqs_sin 496 0=1
MemoryData_t layer11_att_wk_weight 0 1 497 0=2 1=768 2=768 3=108615936
Matmul_t layer11_att_k_linear 2 1 492 497 498
Concat_t layer11_att_k_concat 2 1 k_cache_11 498 499 0=0
Reshape_t layer11_att_k_reshape 1 1 499 500 0=3 1=-1 2=12 3=64
Posenc_t layer11_att_k_posenc 3 1 500 freqs_cos freqs_sin 501 0=0
Matmul_t layer11_att_qk_matmul 2 1 501 496 502
BinaryOp_t layer11_att_qk_div 1 1 502 503 0=Div 1=Param 2=8
Softmax_t layer11_att_qk_softmax 1 1 503 504 0=0
MemoryData_t layer11_att_wv_weight 0 1 505 0=2 1=768 2=768 3=109205760
Matmul_t layer11_att_v_linear 2 1 492 505 506
Concat_t layer11_att_v_concat 2 1 v_cache_11 506 507 0=0
Reshape_t layer11_att_v_reshape 1 1 507 508 0=3 1=-1 2=12 3=64
Matmul_t layer11_att_qkv_matmul 2 1 508 504 509
Reshape_t layer11_att_qkv_reshape 1 1 509 510 0=2 1=-1 2=768
MemoryData_t layer11_att_wo_weight 0 1 511 0=2 1=768 2=768 3=109795584
Matmul_t layer11_att_wo_matmul 2 1 510 511 512
BinaryOp_t layer11_att_shortcut 2 1 485 512 513 0=Add 1=Tensor
UnaryOp_t layer11_ffnnorm_square 1 1 513 514 0=Square
Reduction_t layer11_ffnnorm_mean 1 1 514 515 0=Mean 1=1
BinaryOp_t layer11_ffnnorm_add 1 1 515 516 0=Add 1=Param 2=1e-06
UnaryOp_t layer11_ffnnorm_rsq 1 1 516 517 0=Rsq
BinaryOp_t layer11_ffnnorm_mul1 2 1 513 517 518 0=Mul 1=Tensor
MemoryData_t layer11_ffnnorm_weight 0 1 519 0=1 1=768 2=110385408
BinaryOp_t layer11_ffnnorm_mul2 2 1 518 519 520 0=Mul 1=Tensor
MemoryData_t layer11_ffn_w1_weight 0 1 521 0=2 1=2268 2=768 3=110386176
Matmul_t layer11_ffn_w1_matmul 2 1 520 521 522
Swish_t layer11_ffn_w1_swish 1 1 522 523
MemoryData_t layer11_ffn_w3_weight 0 1 524 0=2 1=2268 2=768 3=112128000
Matmul_t layer11_ffn_w3_matmul 2 1 520 524 525
BinaryOp_t layer11_ffn_mul 2 1 523 525 526 0=Mul 1=Tensor
MemoryData_t layer11_ffn_w2_weight 0 1 527 0=2 1=768 2=2268 3=113869824
Matmul_t layer11_ffn_w2_matmul 2 1 526 527 528
BinaryOp_t layer11_ffn_shortcut 2 1 513 528 529 0=Add 1=Tensor
UnaryOp_t outnorm_square 1 1 529 530 0=Square
Reduction_t outnorm_mean 1 1 530 531 0=Mean 1=1
BinaryOp_t outnorm_add 1 1 531 532 0=Add 1=Param 2=1e-06
UnaryOp_t outnorm_rsq 1 1 532 533 0=Rsq
BinaryOp_t outnorm_mul1 2 1 529 533 534 0=Mul 1=Tensor
MemoryData_t outnorm_weight 0 1 535 0=1 1=768 2=115611648
BinaryOp_t attnorm_mul2 2 1 534 535 536 0=Mul 1=Tensor
MemoryData_t output_embed_weight 0 1 537 0=2 1=32000 2=768 3=115612416
Matmul_t output_matmul 2 1 536 537 output