7767517
8 1
Input_t input 0 1 in
Input_t freqs_cos 0 1 freqs_cos
Input_t freqs_cos 0 1 freqs_sin
Input_t k_cache_0 0 1 k_cache_0
Input_t k_cache_1 0 1 k_cache_1
Input_t k_cache_2 0 1 k_cache_2
Input_t k_cache_3 0 1 k_cache_3
Input_t k_cache_4 0 1 k_cache_4
Input_t k_cache_5 0 1 k_cache_5
Input_t k_cache_6 0 1 k_cache_6
Input_t k_cache_7 0 1 k_cache_7
Input_t v_cache_0 0 1 v_cache_0
Input_t v_cache_1 0 1 v_cache_1
Input_t v_cache_2 0 1 v_cache_2
Input_t v_cache_3 0 1 v_cache_3
Input_t v_cache_4 0 1 v_cache_4
Input_t v_cache_5 0 1 v_cache_5
Input_t v_cache_6 0 1 v_cache_6
Input_t v_cache_7 0 1 v_cache_7
Embed_t input_embed 1 1 in 1 0=512 1=32000 2=16384000 3=0
UnaryOp_t layer0_attnorm_sqaure 1 1 1 2 0=Square
Reduction_t layer0_attnorm_mean 1 1 2 3 0=Mean 1=1
BinaryOp_t layer0_attnorm_add 1 1 3 4 0=Add 1=Param 2=0.000010
UnaryOp_t layer0_attnorm_rsq 1 1 4 5 0=Rsq
BinaryOp_t layer0_attnorm_mul1 2 1 1 5 6 0=Mul 1=Tensor
MemoryData_t layer0_attnorm_weight 0 1 7 0=1 1=512 2=16384000
BinaryOp_t layer0_attnorm_mul2 2 1 6 7 8 0=Mul 1=Tensor
MemoryData_t layer0_att_wq_weight 0 1 9 0=2 1=512 2=512 3=16384512
Matmul_t layer0_att_q_linear 2 1 8 9 10
Reshape_t layer0_att_q_reshape 1 1 10 11 0=3 1=-1 2=8 3=64
Posenc_t layer0_att_q_posenc 3 1 11 freqs_cos freqs_sin 12
MemoryData_t layer0_att_wk_weight 0 1 13 0=2 1=512 2=512 3=16646656
Matmul_t layer0_att_k_linear 2 1 8 13 14
Concat_t layer0_att_k_concat 2 1 k_cache_0 14 15 0=0
Reshape_t layer0_att_k_reshape 1 1 15 16 0=3 1=-1 2=8 3=64
Posenc_t layer0_att_k_posenc 3 1 16 freqs_cos freqs_sin 17
Matmul_t layer0_att_qk_matmul 2 1 17 12 18
BinaryOp_t layer0_att_qk_div 1 1 18 19 0=Div 1=Param 2=8
Softmax_t layer0_att_qk_softmax 1 1 19 20 0=0
MemoryData_t layer0_att_wv_weight 0 1 21 0=2 1=512 2=512 3=16908800
Matmul_t layer0_att_v_linear 2 1 8 21 22
Concat_t layer0_att_v_concat 2 1 v_cache_0 22 23 0=0
Reshape_t layer0_att_v_reshape 1 1 23 24 0=3 1=-1 2=8 3=64
Matmul_t layer0_att_qkv_matmul 2 1 24 20 25
Reshape_t layer0_att_qkv_reshape 1 1 25 26 0=2 1=-1 2=512
MemoryData_t layer0_att_wo_weight 0 1 27 0=2 1=512 2=512 3=17170944
Matmul_t layer0_att_wo_matmul 2 1 26 27 28